In [1]:
%config Completer.use_jedi = False

In [2]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn
%matplotlib inline

In [3]:
data_folder =  "../data/HWTK/en"

In [4]:
ls "../data/HWTK/en/"

hol.feather  itc_en.feather  it_en.feather  sh_en.feather

In [5]:
df_shop = pd.read_feather(os.path.join(data_folder, "sh_en.feather"))
df_item = pd.read_feather(os.path.join(data_folder, "it_en.feather"))
df_item_category = pd.read_feather(os.path.join(data_folder, "itc_en.feather"))
df_train = pd.read_csv(os.path.join("../data/sales_train_v2.csv"))
df_hol = pd.read_feather(os.path.join(data_folder, "hol.feather"))

In [6]:
df_item_category.columns = ["item_category_name", "item_category_id", "item_category_name_in_en"]

In [7]:
df_item_category["item_category_name_in_en"] = df_item_category.item_category_name_in_en.str.lower()

In [8]:
df_train.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [9]:
df_train["date"] = pd.to_datetime(df_train.date, format="%d.%m.%Y")

In [10]:
item_age = (df_train
            .groupby("item_id")
            .aggregate({"date" : ["first", "last"]}))
item_age.columns = item_age.columns.droplevel(0)
item_age["age"] = item_age["last"] - item_age["first"]

In [11]:
item_age.head()

             first       last      age
item_id
0       2014-09-01 2014-09-01   0 days
1       2014-04-04 2014-10-20 199 days
2       2014-08-24 2014-11-12  80 days
3       2014-07-05 2014-08-26  52 days
4       2014-09-19 2014-09-19   0 days

In [12]:
df_item.columns = ["item_name", "item_id", "item_category_id", "item_english_name"]

In [13]:
df_item = df_item.merge(item_age, how="left", left_on="item_id", right_index=True)

In [14]:
df_item.head()

,item_name,item_id,item_category_id,item_english_name,first,last,age
0,ВО ВЛАСТИ НАВАЖДЕНИЯ ПЛАСТ D,0,40.0,IN THE FIRE OF DREATING THE PLAST D,2014-09-01,2014-09-01,0 days
1,ABBYY FineReader 12 Professional Edition Full ...,1,76.0,ABBYY FineReader 12 Professional Edition Full ...,2014-04-04,2014-10-20,199 days
2,В ЛУЧАХ СЛАВЫ UNV D,2,40.0,In the glories of the glory UNV D,2014-08-24,2014-11-12,80 days
3,ГОЛУБАЯ ВОЛНА Univ D,3,40.0,BLUE WAVE Univ D,2014-07-05,2014-08-26,52 days
4,КОРОБКА СТЕКЛО D,4,40.0,BOX GLASS D,2014-09-19,2014-09-19,0 days

In [15]:
df_train = (df_train
            .merge(df_item, on="item_id", how="left")
            .loc[:, ["date_block_num", "shop_id", "item_id", "first", "last", "age", "item_category_id", "item_cnt_day"]])

In [16]:
df_train.head()

,date_block_num,shop_id,item_id,first,last,age,item_category_id,item_cnt_day
0,0,59,22154,2013-01-02,2015-10-10,1011 days,37.0,1.0
1,0,25,2552,2013-01-03,2015-05-27,874 days,58.0,1.0
2,0,25,2552,2013-01-03,2015-05-27,874 days,58.0,-1.0
3,0,25,2554,2013-01-06,2013-01-06,0 days,58.0,1.0
4,0,25,2555,2013-01-15,2014-10-18,641 days,56.0,1.0

In [17]:
def clean_and_simplify_english_name(x):
    x = x.lower()
    if "accessor" in x: return "acc"
    elif "game consoles" in x: return "gc" 
    elif "games" in x: return "games"
    elif "books" in x: return "books"
    elif "programs" in x: return "programs"
    elif "gift" in x: return "gift"
    elif "movie" in x: return "movie"
    elif "music" in x: return "music" 
    else: return "misc"

In [18]:
def get_console_type(x):
    if "ps2" in x: return "ps2"
    elif "ps3" in x: return "ps3"
    elif "ps4" in x: return "ps4"
    elif "pc" in x: return "pc"
    elif "ps4" in x: return "ps4"
    elif "xbox 360" in x: return "xbox 360"
    elif "xbox one" in x: return "xbox one"
    else: return "zero"

In [19]:
df_item_category.head()

      item_category_name  item_category_id item_category_name_in_en
0  PC Гарнитуры Наушники                 0   pc headsets headphones
1         Аксессуары PS2                 1          ps2 accessories
2         Аксессуары PS3                 2          ps3 accessories
3         Аксессуары PS4                 3          ps4 accessories
4         Аксессуары PSP                 4          psp accessories

In [20]:
df_item_category["console_type"] = df_item_category.item_category_name_in_en.apply(get_console_type)
df_item_category["item_category_name_in_en"] = df_item_category.item_category_name_in_en.apply(clean_and_simplify_english_name)

In [21]:
df_item_category.head()

,item_category_name,item_category_id,item_category_name_in_en,console_type
0,PC Гарнитуры Наушники,0,misc,pc
1,Аксессуары PS2,1,acc,ps2
2,Аксессуары PS3,2,acc,ps3
3,Аксессуары PS4,3,acc,ps4
4,Аксессуары PSP,4,acc,zero

In [22]:
df_train = df_train.merge(df_item_category, on="item_category_id", how="left")

In [23]:
df_train.head()

,date_block_num,shop_id,item_id,first,last,age,item_category_id,item_cnt_day,item_category_name,item_category_name_in_en,console_type
0,0,59,22154,2013-01-02,2015-10-10,1011 days,37,1.0,Кино Blu Ray,movie,zero
1,0,25,2552,2013-01-03,2015-05-27,874 days,58,1.0,Музыка Винил,music,zero
2,0,25,2552,2013-01-03,2015-05-27,874 days,58,-1.0,Музыка Винил,music,zero
3,0,25,2554,2013-01-06,2013-01-06,0 days,58,1.0,Музыка Винил,music,zero
4,0,25,2555,2013-01-15,2014-10-18,641 days,56,1.0,Музыка CD фирменного производства,music,zero

In [24]:
df_train["week_age"] = df_train.age.dt.days / 7.0

In [25]:
df_train.head()

,date_block_num,shop_id,item_id,first,last,age,item_category_id,item_cnt_day,item_category_name,item_category_name_in_en,console_type,week_age
0,0,59,22154,2013-01-02,2015-10-10,1011 days,37,1.0,Кино Blu Ray,movie,zero,144.428571
1,0,25,2552,2013-01-03,2015-05-27,874 days,58,1.0,Музыка Винил,music,zero,124.857143
2,0,25,2552,2013-01-03,2015-05-27,874 days,58,-1.0,Музыка Винил,music,zero,124.857143
3,0,25,2554,2013-01-06,2013-01-06,0 days,58,1.0,Музыка Винил,music,zero,0.000000
4,0,25,2555,2013-01-15,2014-10-18,641 days,56,1.0,Музыка CD фирменного производства,music,zero,91.571429

In [26]:
df = df_train.groupby(["date_block_num", "shop_id", "item_id"]).aggregate({"item_cnt_day": np.sum, "week_age": np.mean})

In [28]:
df.sample(20)

                                  week_age  item_cnt_day
date_block_num shop_id item_id
7              31      9615      68.857143           1.0
11             26      17763     33.285714           1.0
20             27      9355      57.000000           6.0
0              6       4688      58.857143           1.0
4              47      15004     90.428571           1.0
22             54      20532     78.714286           1.0
9              22      7199      94.428571           1.0
7              28      15455    142.571429           3.0
11             6       4845      68.714286           6.0
30             27      20340    102.857143           1.0
14             58      12397     79.571429           9.0
23             17      18370     59.714286           1.0
3              30      7388      71.428571           1.0
20             10      9831      49.428571           1.0
15             58      16587    135.428571           1.0
24             57      9863      80.571429           2.0
4              57      16706     34.000000           1.0
8              31      9785      73.142857           1.0
15             55      2455      79.428571           1.0
23             48      15456    133.714286           1.0

In [105]:
tr %<>% 
  left_join(itc_en %>% select(itc_id, mtype), by='itc_id')

tr %<>% 
  mutate(week_age = as.numeric(difftime(date, age, units="weeks"))) %>% 
  select(-recency)
# Main data frame define
df <- tr %>% 
  group_by(dbn, s_id, it_id) %>% 
  summarise(sales = sum(count), avg_age = mean(week_age)) %>% 
  ungroup

In [106]:
head(df)

  dbn s_id it_id sales avg_age
1 0   0    32    6     2.714286
2 0   0    33    3     2.142857
3 0   0    35    1     1.142857
4 0   0    43    1     3.571429
5 0   0    51    2     2.857143
6 0   0    61    1     0.000000

In [107]:
# Add previous month for joining with other df
df %<>% 
  mutate(prev_dbn = dbn-1)

# previous month sales average for a shop and total number 
# of items each shop selling
df %<>% 
  left_join(df %>% 
              group_by(dbn, s_id) %>% 
              summarize(shop_sales = mean(sales), it_count = n()),
            by=c("prev_dbn" = "dbn", "s_id"))

# previous month item average sales and total number of shop's selling them.
df %<>% 
left_join(df %>% 
            group_by(dbn, it_id) %>% 
            summarize(it_sales = mean(sales), shop_count = n()),
          by=c("prev_dbn" = "dbn", "it_id"))

# previous month shop, item sales
df %<>% 
  left_join(df %>% 
              select(dbn, s_id, it_id, sales) %>% 
              rename(prev_sales = sales),
            by = c("prev_dbn" = "dbn", "s_id", "it_id"))

In [108]:
df %>% sample_n(20)

   dbn s_id it_id sales avg_age    prev_dbn shop_sales it_count it_sales
1  18  56    2578  2      3.142857 17       1.787543   1445      2.727273
2   6  47   14931  2     29.214286  5       1.841871    898      3.310345
3   4  51   18509  3     18.904762  3       1.651104   1178      1.285714
4   1  31   16229  5      5.642857  0       3.004430   3386      1.571429
5  20  31   11903  1     34.000000 19       2.943612   2802      1.375000
6  14   4    2854  4     62.678571 13       1.896350    685      2.096774
7   2  19    6340  1      8.428571  1       2.067104   1371      1.000000
8   1  15    3077  1      7.714286  0       2.214634   1230      2.750000
9  32  42   21672  1     39.428571 31       2.448562   1565      1.100000
10 23  19   10748  2      1.142857 22       2.155242    992            NA
11  1  54   22103  1      6.428571  0       2.838222   3307      1.000000
12 12  25    6489  2     51.857143 11       3.506810   3451      1.000000
13 24  52   15279  1     58.571429 23       2.090401   1073      1.827586
14 16  37    2929  1     72.428571 15       1.798095    525      1.416667
15 14  31   15136 10     21.125000 13       3.268817   2976      4.280000
16  2  24   21536  2     10.071429  1       1.789157    996      1.500000
17 11   7   16021  3     50.571429 10       2.295880   1068      1.466667
18 10  54   14560  1     46.714286  9       2.510718   2659            NA
19 10  54   21919 12      2.836735  9       2.510718   2659      2.882353
20 24  54    5822 25    106.241071 23       3.289203   2334     16.062500
   shop_count prev_sales
1  22         NA
2  29          2
3   7          3
4   7          1
5   8          3
6  31          1
7   1         NA
8  28          3
9  10          2
10 NA         NA
11  3          1
12  2         NA
13 29          1
14 12          1
15 25          3
16  4         NA
17 15         NA
18 NA         NA
19 34          9
20 48         21

In [109]:
# Add lag features
lag_times = c(2, 3 ,6, 9, 12)

for (i in lag_times){
    lag_field  <- paste('lag_sales_', as.character(i), sep = '')
    
    df %<>% 
        mutate(lag_dbn = dbn-i) %>% 
        left_join(df %>% 
                    select(dbn, s_id, it_id, sales) %>% 
                    rename(!!lag_field := sales),
                  by = c("lag_dbn" = "dbn", "s_id", "it_id"))
}

In [141]:
df %>% sample_n(10)

   dbn s_id it_id sales avg_age    prev_dbn shop_sales it_count it_sales
1  28  31   21619 1     124.571429 27       3.060025   2399     1.250000
2  30  47   13300 2       1.500000 29       2.148148    810           NA
3  28  25    6625 2      56.357143 27       2.864146   2142     1.083333
4  24  21    4334 1       9.857143 23       2.539448   1559     4.279070
5  11  31    7055 3      14.190476 10       3.504939   3341     1.733333
6  22  56   17890 2      24.285714 21       1.696123   1109     1.000000
7  20  28    7213 1      77.571429 19       3.263217   1778     1.724138
8  27  48    7895 2     119.142857 26       1.544855    758     2.047619
9   7   6    6635 1      32.285714  6       1.906924   1762     1.214286
10 29  59   15063 1     109.428571 28       1.810277    506     1.428571
   shop_count prev_sales lag_dbn lag_sales_2 lag_sales_3 lag_sales_6
1   8          1         16       1           4          NA
2  NA         NA         18      NA          NA          NA
3  12          1         16       1           1           1
4  43          2         12       1          NA          NA
5  15          2         -1       5          14          NA
6   5         NA         10      NA           2           2
7  29          2          8       2           3           4
8  21          1         15      NA           2           1
9  14         NA         -5      NA          NA          NA
10 21          1         17      NA           2           2
   lag_sales_9 lag_sales_12
1   4           1
2  NA          NA
3  NA           2
4  NA          NA
5  NA          NA
6  NA          NA
7   6           1
8   1          NA
9  NA          NA
10 NA           1

In [125]:
# Replace all na with 0

sales_columns <- str_detect(colnames(df), 'sales')

In [132]:
df[,sales_columns] %>% replace_na(0)

ERROR: Error: is_list(replace) is not TRUE

In [137]:
df[,sales_columns]  %>% replace_na(rep(0, nrow(.))) %>% head

ERROR: Error: is_list(replace) is not TRUE

In [139]:
seq(0, nrow(df))